{
  "welcomeTitle": "Hi, I'm Daniil Ulyanov!",
  "welcomeDescription": "A {{age}}-Year-Old Frontend Developer from Russia, who loves old school computer games, delicious pizza, Breakcore music and JavaScript!",
  "welcomeWorkingSince": "Developing projects since 2021.",
  "knowledgesType": "Type",
  "knowledgesName": "Name",
  "knowledgesLevel": "Level",
  "knowledgesYears": "years",
  "experienceSince": "since",
  "experienceTo": "to",
  "experienceStack": "Stack",
  "experienceFreelanceTitle": "Freelance",
  "experienceFreelanceDescription": "I gained my first experience as a freelance developer. I managed to practice with a lot of technologies. I was involved in a variety of tasks: starting from fixing bugs in CSS to refactoring the code of online shops from scratch using TypeScript + React.",
  "experienceLinkiiieTitle": "Linkiiie.ru",
  "experienceLinkiiieDescription": "I was involved in the development of a startup for aggregating links to useful tutorials. Specifically, I was engaged in code reviews and frontend development based on Figma designs. I managed to gain teamwork experience through close interaction with backend developers.",
  "experienceDESCTitle": "DESC-Studio.ru",
  "experienceDESCDescription": "I was part of an outsourced web development team. My responsibilities varied by projects: participating in code reviews, frontend development based on Figma designs (using React + TypeScript), and email layouts for mailings. I was interacting with designers, teamleader and backend developers. I managed to consolidate my knowledge of React, JavaScript and TypeScript, as well as gain experience with multilingual websites.",
  "experienceQChartTitle": "QChart.io",
  "experienceQChartDescription": "I managed to participate in the frontend development of a stock analytics startup. The project was written in React with the backend based on Nest.js with data aggregation over WebSockets. I was able to build the frontend using a combination of React + TypeScript + Zustand and participate in a lot of code reviews.",
  "experienceSlexTitle": "Slex.io / Slavi.io / SimpleDev",
  "experienceSlexDescription": "I was actively involved in the frontend development of four projects: a cryptocurrency wallet, a stock exchange, a telegram web-app (@richteddy_bot) and corporate website based on React / Next.js + TypeScript. The projects allowed me to reveal my skills in a variety of tasks: from component layout to working with a large number of factories processing APIs, long polling connection APIs showing locations of different items on YandexMaps, creating clicker-apps (Hamster Combat styled like), creating custom admin-panels and etc. Constantly participated in code reviews on GitLab.",
  "contactsTitle": "where can you find me?",
  "codedAndDesigned": "Coded and designed by Daniil Ulyanov in 2025",
  "projectVersion": "Project version",
  "checkTheRepo": "Check the Repo!",
  "switchToLanguage": "Русская версия"
}