{
  "welcomeTitle": "Привет, я Даниил Ульянов!",
  "welcomeDescription": "{{age}}-летний фронтенд-разработчик из России, который очень любит олдскульные игры, вкусную пиццу, брейккор и JavaScript!",
  "welcomeWorkingSince": "Разрабатываю проекты с 2021 года.",
  "knowledgesType": "Навык",
  "knowledgesName": "Технология",
  "knowledgesLevel": "Опыт",
  "knowledgesYears": "лет",
  "experienceSince": "c",
  "experienceTo": "по",
  "experienceStack": "Стек",
  "experienceFreelanceTitle": "Фриланс",
  "experienceFreelanceDescription": "Я обрёл свой первый опыт в качестве фриланс-разработчика. Мне удалось попрактиковаться с большим количеством технологий. Занимался простыми и сложными тасками: от CSS-багфиксов до переписывания небольших магазинов с нуля на TypeScript + React.",
  "experienceLinkiiieTitle": "Linkiiie.ru",
  "experienceLinkiiieDescription": "Я участвовал в разработке стартапа по агрегации ссылок на полезные руководства. В частности, занимался код-ревью и фронтенд-разработкой по дизайну на Figma. Обрёл опыт командной работы благодаря тесному взаимодействию с бэкенд-разработчиками.",
  "experienceDESCTitle": "DESC-Studio.ru",
  "experienceDESCDescription": "Я был частью команды по веб-разработке на аутсорсе. Мои обязанности различались по проектам: участие в код-ревью, фронтенд-разработке по дизайну Figma (на React + TypeScript) и вёрстке писем для рассылок. Взаимодействовал с дизайнерами, тимлидом и бэкенд-разработчиками. Удалось закрепить знания React, JavaScript и TypeScript, а также обрести опыт работы с многоязычными сайтами.",
  "experienceQChartTitle": "QChart.io",
  "experienceQChartDescription": "Я смог принять участие в фронтенд-разработке стартапа по биржевой аналитике. Проект был написан на React с бэкендом на Nest.js с агрегацией данных через веб-сокеты. Мне удалось создать фронтенд на сочетании React + TypeScript + Zustand и поучаствовать с большим количеством код-ревью.",
  "experienceSlexTitle": "Slex.io / Slavi.io / SimpleDev",
  "experienceSlexDescription": "Я принимал активное участие в разработке интерфейса четырех проектов: криптовалютного кошелька, крипто-биржи, telegram web-app (@richteddy_bot) и корпоративного сайта на базе React / Next.js + TypeScript. Проекты позволили мне раскрыть свои навыки в самых разных задачах: от обычной вёрстки Реакт-компонентов до работы с большим количеством API-фабрик, лонг-поллинг API, показывающих местоположение различных объектов на Яндекс-картах, создания приложений-кликеров (в стиле Hamster Combat), создания пользовательских панелей администратора и т.д. Постоянно участвовал в обзорах кода на GitLab.",
  "contactsTitle": "где можно меня найти?",
  "codedAndDesigned": "Разработано Даниилом Ульяновым в 2025 году",
  "projectVersion": "Версия проекта",
  "checkTheRepo": "Глянуть репозиторий!",
  "switchToLanguage": "Switch to English"
}